models/User.php

SELECT * FROM `user` WHERE (`id`=1) AND (`status`=1)
---
    public static function findIdentity($id) {
//        **** เขียนเพิ่ม  ใช้ในการเช็คค่าสิทธิ์ว่าสถานะเป็นอะไร*****
        return static::findOne(['id'=>$id, 'status'=>  self::STATUS_ACTIVE]);